# **Using mean in ABC Statistics**

In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns

In [2]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df['age'].mean()

29.69911764705882

In [4]:
df['fare'].mean()

32.204207968574636

In [5]:
from scipy import stats 
data = np.array([20, 45, 35, 75, 90])

In [6]:
stats.gmean(data)

46.29380365247807

In [7]:
stats.hmean(data)

39.92395437262358

In [8]:
data.mean()

53.0

In [9]:
stats.trim_mean(data, 0.1)

53.0

# **Calculate the median**

In [10]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
df['age'].mean()

29.69911764705882

In [12]:
df['age'].median()

28.0

# **Finding range of a data**

In [13]:
# finding the range
df = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90])

np.ptp(df)

80

In [14]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [15]:
np.ptp(df['pclass'])

2

# **Variance**

In [16]:
# import libraries
import numpy as np 

# creating a dataset
dataset = np.array([2,3,4,5,6])

# calculating mean
mean = np.mean(dataset)
mean

4.0

In [17]:
# lets calculate the variance
var = np.var(dataset)
var

2.0

# **Standard Deviation**

In [3]:
# first import library
import numpy as np 

dataset1 = np.array([2,3,4,5,6])

# calculate the standard deviation
st_dev = np.std(dataset1, ddof=1)
st_dev

1.5811388300841898